let plots = ["Начальник пражского отдела ЦРУ Джим Фелпс (Джон Войт) получает кассету с заданием для отряда IMF. Полученная миссия состоит в слежке за предполагаемым предателем, Александром Голицыным (Марсель Юрес), который собирается украсть список агентов ЦРУ из офиса IMF и продать его некому Максу. Джим встречается со своим отрядом, куда вошли его правая рука Итан Хант (Том Круз), его жена Клэр (Эммануэль Беар), хакер Джек Хармон (Эмилио Эстевес), наблюдательница Ханна Уильямс (Ингеборга Дапкунайте) и шпионка под прикрытием Сара Дэйвис (Кристин Скотт Томас). После встречи и разработки плана опергруппа идет на миссию, которая внезапно идёт совершенно не по плану. Члены опергруппы гибнут один за другим, Голицын тоже становится жертвой. Итан обнаруживает, что остался один, а убийца украл диск у Голицына, затем убегает и запрашивает эвакуацию",
"Фильм начинается с закадрового монолога о том, что современное человечество слишком занято своими проблемами и совершенно не замечает того, что за ними следят инопланетяне со злыми намерениями (слегка изменённая цитата из начала книги Уэллса)",
"В фильме одновременно разворачиваются три истории. Сенатор с Капитолийского холма Джаспер Ирвинг (Том Круз) пригласил тележурналистку Жанин Рот (Мерил Стрип) чтобы заявить о новой военной стратегии войск США в Афганистане. Он надеется, что положительная статья Рот об этой кампании убедит людей в правильности действий правительства. Однако журналистку терзают сомнения, и она не хочет становиться инструментом правительственной пропаганды.",
"Том Круз играет тайного агента, который случайно завязывает знакомство с обычной девушкой — героиней Камерон Диас, и в результате втягивает её в задание защитить сверхмощную батарейку, которая является ключом к созданию неисчерпаемого источника энергии, от преступников, пытающихся воспользоваться ею в своих целях. В фильме говорится, что эта батарея способна питать даже небольшой город: чем не отличный повод, чтобы завладеть ей? Вместе с батареей тайный агент оберегает от преступников создавшего её молодого учёного, не так давно окончившего школу и не способного защититься от них самостоятельно. Между агентом и девушкой возникают любовные отношения, но они не ставятся на «передний план».",
"В 1975 году отец Остина Пауэрса — знаменитый английский шпион Найджел Пауэрс — был похищен голландским злодеем Голдмембером. Теперь, в XXI веке, знаменитый шпион Остин Пауэрс решает помочь своему отцу. Заручившись поддержкой своего давнего врага — Доктора Зло, с помощью его машины времени Остин совершает прыжок в прошлое. Он оказывается в 1975 году, в эпохе диско. Однако вскоре выясняется, что одержимый идеей завоевать весь мир Доктор Зло был сам в сговоре с Голдмембером и, возможно, причастен к похищению отца Остина. Может быть, похищение Найджела Пауэрса — это всего лишь уловка двух злодеев, совершённая, чтобы заманить к себе Остина Пауэрса? Вместе со своей очаровательной давней подружкой Фокси Клеопатрой Остин Пауэрс пытается распутать злодейские планы Доктора Зло и Голдмембера, чтобы не только выручить своего отца, но и спасти весь мир от этих злодеев.",
"1876 год. Отставной капитан кавалерии Армии Союза, участник войн с индейцами Нэйтан Олгрен зарабатывает на жизнь рекламой винчестеров. Сержант Зеб отводит его на встречу с японцами и полковником Багли, вместе с которым Олгрен воевал против краснокожих. Глава делегации Омура, японский министр, предлагает Олгрену тренировать солдат японской императорской армии",
"Жизнь богатого плейбоя Дэвида Эймса удалась по всем статьям: у него были деньги, собственный издательский дом, дорогая машина и квартира в респектабельном районе Нью-Йорка, друг-писатель и подружка Джулианна, даже враги, в лице семи управляющих его компанией, тоже были. Единственное, что отравляло его существование — это боязнь высоты.",
"Опытный тренер Гарри Хогг (Роберт Дюваль), покинувший мир профессиональных гонок во избежание скандального расследования, принимает предложение менеджера Тима Дэленда (Рэнди Куэйд) подготовить к соревнованиям Коула Трикла (Том Круз), прежде участвовавшего исключительно в состязаниях на формулах, но желающего испытать силы в NASCAR. Серия заездов проходит успешно, превратив Трикла в самого многообещающего новичка сезона, — но вскоре он вместе с главным соперником Роуди Бёрнсом (Майкл Рукер) попадает в аварию. Зато в клинике Коулу суждено встретить женщину своей мечты — доктора Клер Левики (Николь Кидман).",
"Молодой бизнесмен Чарли Бэббитт (Том Круз) неожиданно узнаёт, что его умерший отец-миллионер оставил наследство не ему, а его страдающему аутизмом брату Рэймонду (Дастин Хоффман), живущему в лечебнице для душевнобольных. О его существовании Чарли раньше и не догадывался. Он решает увезти своего брата из лечебницы и не возвращать его, пока половина наследства не будет отдана ему.",
"Уволенный за критику начальства, спортивный агент Джерри Магуайер решает создать свою фирму. Лишь два человека верят в него — влюбленная в Магуайера Дороти (Рене Зеллвегер) и Род Тидуэлл (Кьюба Гудинг-мл.) — талантливый спортсмен, но нахальный и крайне злобный тип. Однако обстоятельства не останавливают Джерри — он уверен в себе и твёрдо знает, чего хочет. И все могло бы быть как нельзя лучше, если бы не его бывшие коллеги. Для них все методы хороши - особенно если нужно доказать правдолюбцу, кто правит бал. И Джерри Магуайер знает - если он проиграет, то встать на ноги ему не удастся никогда."];

let bgImages = ["../img/mission-impossible.jpg","../img/war.jpg","../img/lions-et-agneaux.jpg",
"../img/knight-and-day.jfif", "../img/goldmember.jpg", "../img/last-samurai.jpg",
"../img/vanilla-sky.jpeg", "../img/days-of-thunder.jfif","../img/rain-man.jpg",
"../img/jerry-maguire.webp"];

let plotText = document.getElementById("plot-text");
let plotDiv = document.getElementById("plot")
let plotDivPar = plotDiv.getElementsByTagName("p")[0];
let actor = document.getElementById("actor");
let body = document.body;
let pl = "";
let bg = "";


function films(id){
    pl = plots[id];
    bg = bgImages[id];
    plotDiv.style.display = "block";
    plotText.style.display = "inline";
    body.style.backgroundImage = `url(${bg})`;
    plotDivPar.innerText = pl;
    actor.style.opacity = 0.6;
}